wisp-tests/2025-07-14_07:08:54/data/attachments/1c20e67ecc3286a2.txt

URL: https://api.uat.platform.pagopa.it/nodo/node-for-psp/v1
Request:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header />
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>AGID_01</idPSP>
			<idBrokerPSP>97735020584</idBrokerPSP>
			<idChannel>97735020584_03</idChannel>
			<password>***</password>
			<idempotencyKey>348175247696404014_0226380798</idempotencyKey>
			<qrCode>
				<fiscalCode>15376371009</fiscalCode>
				<noticeNumber>348175247696404014</noticeNumber>
			</qrCode>
			<expirationTime>900000</expirationTime>
			<amount>974.98</amount>
			<paymentNote>ac2dbed5-e70a-4d07-9dc8-aa85dae8b6bc</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>
